/*##############################################################################################################################################
    *프로그램명: D -day 출력 프로그램
    *소스파일명: d-day.js
    *작성자: 장승배
    *버전: 1.0.0
    *생성자: 장승배
    *생성일자: 2021.10.20
    *최종수정일자: 2021.12.15
    *최종수정자: 장승배
    *최종수정내용: httml과 자바스크립트를 분라함
    --------------------------------------------------------------------------------------
    *내용: 지정된 날짜가 계속해서 시간을 계산 해줌

    *출처: https://juyeol.tistory.com/12

#############################################################################################################################################*/
var countDownDate = new Date("12 18, 2021 18:00:00").getTime();                         //D-DAY 종료일 지정
 
var x = setInterval(function() {                                                       //1초마다 갱신되도록 함수 생성,실행               
var now = new Date().getTime();                                                        // 오늘 날짜 등록 // 현재 날짜의 밀리초 계산
var distance = countDownDate - now;                                                    // 종료일자에서 현재일자를 뺀 시간

var d = Math.floor(distance / (1000 * 60 * 60 * 24));                                  // 각 변수에 일, 시, 분, 초를 등록
var h = Math.floor((distance % (1000 * 60 * 60 * 24)) / (1000 * 60 * 60));
var m = Math.floor((distance % (1000 * 60 * 60)) / (1000 * 60));
var s = Math.floor((distance % (1000 * 60)) / 1000);

if(d === 0) {
}
document.getElementById("d-day").innerHTML = "다음 로또 추첨까지: " + d +"일 " + h         // 화면에 삽입
    + "시간 " + m + "분 " + s + "초 남았습니다.";

}
);