/*###############################################################################################################################################
   
    *프로그램명: 시간에 따른 다크모드 적용
    *소스파일명: dark_mide_time.js
    *작성자: 장승배
    *버전: 1.0.0
    *생성자: 장승배
    *생성일자: 2021.10.20
    *최종수정일자: 2021.12.15
    *최종수정자: 장승배
    *최종수정내용: httml과 자바스크립트를 분라함
    --------------------------------------------------------------------------------------
    *내용: 05시부터 18시 까지는 화이트모드가 적용이 되며 그 이후의 모든 시간에는 다크모드가 적용이 되는 프로그램.

###################################################################################################################################################*/
var date = new Date();
var hour = date.getHours();
    
if(5 < hour && hour <18){
    document.body.style.backgroundColor = 'white';
    document.body.style.color = 'Black';
    
}else{
    document.body.style.backgroundColor = 'Black';
    document.body.style.color = 'Black';
};   

